aa8764114/nRF5_SDK/examples/my_project/ble_app_blinky_DFU_fds2/main.c
        case FDS_EVT_WRITE:
        {
            if (p_evt->result == NRF_SUCCESS)
            {
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->write.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->write.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->write.record_key);
            }
        } break;

        case FDS_EVT_DEL_RECORD:
        {
            if (p_evt->result == NRF_SUCCESS)
            {
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->del.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->del.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->del.record_key);
            }
            m_delete_all.pending = false;
        } break;

        default:
            break;
    }
}

/**@brief   Sleep until an event is received. */
static void power_manage(void)
{
#ifdef SOFTDEVICE_PRESENT
    (void) sd_app_evt_wait();
#else
    __WFE();
#endif
}

/**@brief   Wait for fds to initialize. */
static void wait_for_fds_ready(void)
{
    while (!m_fds_initialized)
    {
        power_manage();
        NRF_LOG_INFO("wait_for_fds_ready");
    }
}
//--------------------------------------------------------------------------------------------



/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    log_init();
    leds_init();
    timers_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    //--------------------------------------------------------------------------------------------
    //fds
    NRF_LOG_INFO("FDS example started.")

    /* Register first to receive an event when initialization is complete. */
    (void) fds_register(fds_evt_handler); //註冊FDS

    NRF_LOG_INFO("Initializing fds...");

    ret_code_t rc;
    rc = fds_init();    //初始化FDS
    APP_ERROR_CHECK(rc);

    /* Wait for fds to initialize. */
    wait_for_fds_ready();   //等待FDS初始化完成

    fds_record_desc_t desc = {0};   //透過他拿到要拿到的內部儲存空間在哪
    fds_find_token_t  tok  = {0};

    rc = fds_record_find(CONFIG_FILE, CONFIG_REC_KEY, &desc, &tok); //找到要讀取的內部儲存空間位址

    if (rc == NRF_SUCCESS)  //如果有找到
    {
        /* A config file is in flash. Let's update it. */
        fds_flash_record_t config = {0};    //從內部儲存空間讀到的資料會放這裡

        /* Open the record and read its contents. */
        rc = fds_record_open(&desc, &config);   //打開儲存空間中的內容
        APP_ERROR_CHECK(rc);

        /* Copy the configuration from flash into m_dummy_cfg. */
        //m_dummy_cfg:存要記錄資訊的結構
        memcpy(&m_dummy_cfg, config.p_data, sizeof(configuration_t));   //把弄到的儲存空間內容複製到RAM中

        NRF_LOG_INFO("Config file found, updating boot count to %d.", m_dummy_cfg.boot_count);  //印出當前的重開次數

        /* Update boot count. */
        m_dummy_cfg.boot_count++;   //重開次數+1

        /* Close the record when done reading. */
        rc = fds_record_close(&desc);   //關檔
        APP_ERROR_CHECK(rc);

        /* Write the updated record to flash. */
        //m_dummy_record裡面的欄位用指標接到m_dummy_cfg
        rc = fds_record_update(&desc, &m_dummy_record); //更新內部儲存空間中的內容
        if ((rc != NRF_SUCCESS) && (rc == FDS_ERR_NO_SPACE_IN_FLASH))
        {
            NRF_LOG_INFO("No space in flash, delete some records to update the config file.");
        }
        else
        {
            APP_ERROR_CHECK(rc);
        }
    }
    else     //如果沒搜尋到
    {
        /* System config not found; write a new one. */
        NRF_LOG_INFO("Writing config file...");

        rc = fds_record_write(&desc, &m_dummy_record);  //直接把m_dummy_record的內容寫入內部儲存空間
        if ((rc != NRF_SUCCESS) && (rc == FDS_ERR_NO_SPACE_IN_FLASH))
        {
            NRF_LOG_INFO("No space in flash, delete some records to update the config file.");
        }
        else
        {
            APP_ERROR_CHECK(rc);
        }
    }

    //--------------------------------------------------------------------------------------------
    // Start execution.
    NRF_LOG_INFO("Blinky example started.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
